app/views/users/index.html.erb

    <br>
    Artworks: <%= u.artworks.length %>
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."user_id" = $1  [["user_id", 5]]