app/views/users/show.html.erb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."user_id" = $1 ORDER BY "artworks"."id" ASC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
      <%= image_tag @user.image, :class =>'feature' %>
      <h4>Artworks: <%= @user.artworks.length %></h4>

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 5]]
---
    <h1> Photos </h1>
      <% @user.photos.each do |p| %>