app/controllers/artworks_controller.rb

  def show
    @artwork = Artwork.find params[:id]
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def edit
    @artwork = Artwork.find params[:id]
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    artwork = Artwork.find params[:id]
    cloudinary = Cloudinary::Uploader.upload(params["artwork"]["image"])
    artwork.image = cloudinary["url"]
    artwork.save
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "artworks" SET "photo_id" = $1, "image" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["photo_id", nil], ["image", "http://res.cloudinary.com/jheepark/image/upload/v1504067786/vw59tpiox2hrsqo6xlet.png"], ["updated_at", "2017-08-30 04:36:27.377128"], ["id", 16]]

  def create
    cloudinary = Cloudinary::Uploader.upload(params["artwork"]["image"])
    @artwork = Artwork.new artwork_params
    @artwork.user_id = @current_user.id
    @artwork.photo_id = params[:photo_id]
    @artwork.image = cloudinary["url"]
    @artwork.save
---
INSERT INTO "artworks" ("image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["image", "http://www.manet.org/images/gallery/olympia.jpg"], ["user_id", 11], ["created_at", "2017-08-26 11:41:40.057746"], ["updated_at", "2017-08-26 11:41:40.057746"]]

  def destroy
    artwork = Artwork.find params[:id]
    artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]