app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hello stinky"], ["user_id", 10], ["created_at", "2017-08-30 09:29:26.493459"], ["updated_at", "2017-08-30 09:29:26.493459"]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
def create
  @comment = Comment.new comment_params
  @current_user.comments << @comment
  @comment.user_id = @current_user.id
  artwork = Artwork.find params[:artwork_id]

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
def destroy
  comment = Comment.find params[:id]
  comment.destroy