app/controllers/photos_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @photo = Photo.find params[:id]

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @photo = Photo.find params[:id]

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "photos" SET "image" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["image", "http://res.cloudinary.com/jheepark/image/upload/v1504068290/krvnscjeawsg37dwyuwt.jpg"], ["updated_at", "2017-08-30 04:44:51.219230"], ["id", 4]]
---
  def update
    photo = Photo.find params[:id]
    cloudinary = Cloudinary::Uploader.upload(params["photo"]["image"])
    photo.image = cloudinary["url"]
    photo.save

INSERT INTO "photos" ("image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["image", "https://www.thefamouspeople.com/profiles/images/douard-manet-1.jpg"], ["user_id", 11], ["created_at", "2017-08-26 11:46:38.360343"], ["updated_at", "2017-08-26 11:46:38.360343"]]
---
  def create
    cloudinary = Cloudinary::Uploader.upload(params["photo"]["image"])
    @photo = Photo.new photo_params
    @photo.user_id = @current_user.id
    @photo.image =cloudinary["url"]
    @photo.save