app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "location", "image", "created_at", "updated_at", "password_digest", "longitude", "latitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    cloudinary = Cloudinary::Uploader.upload(params["user"]["image"])
    @user = User.new user_params
    @user.image = cloudinary["url"]
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    redirect_to root_path unless @current_user.id == params[:id].to_i
    @user = User.find params[:id]

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "location" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["location", "25/268 Johnston Street, Annandale, Sydney"], ["latitude", -33.8746558], ["longitude", 151.1732341], ["updated_at", "2017-08-30 12:05:18.663921"], ["id", 9]]
---
  def update
    user = @current_user
    user = User.find params[:id]
    cloudinary = Cloudinary::Uploader.upload(params["user"]["image"])
    user.update user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]
---
  def destroy
    user = User.find params[:id]
    user.destroy